Tekla Open API Reference for Tekla Structures 2025
AnalysisModelModalAnalysisProperties.ModalAnalysisMassLoadGroupDirections Property
 The mass load group directions of the modal analysis.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public List<int> ModalAnalysisMassLoadGroupDirections { get; set; }
Public Property ModalAnalysisMassLoadGroupDirections As List(Of Integer)
	Get
	Set
Property Value
Type: List<Int32>
See Also
Reference
AnalysisModelModalAnalysisProperties Class
Tekla.Structures.Analysis Namespace